mainconf/Documents/РасходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РасходныйКассовыйОрдер</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровИУслуг</xr:Item>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРасходаДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

mainconf/Enums/ВидыОперацийРасходаДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасходаДенег</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

mainconf/Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

mainconf/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРожденияКлиента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Абонементы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламныйИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

mainconf/Documents/РасходныйКассовыйОрдер/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()

СтрокаТипПолучателя = "";
Если Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВыдачаПодотчетнику")
	ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВыдачаЗаработнойПлаты") Тогда
    Элементы.Договор.Видимость = Ложь;
    Элементы.Получатель.Видимость = Истина;
    СтрокаТипПолучателя = "СправочникСсылка.Сотрудники";
ИначеЕсли Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ОплатаПоставщику")
    ИЛИ Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВозвратПокупателю") Тогда
    СтрокаТипПолучателя = "СправочникСсылка.Контрагенты";
    Элементы.Договор.Видимость = Истина;
    Элементы.Получатель.Видимость = Истина;
КонецЕсли;
Если ЗначениеЗаполнено(СтрокаТипПолучателя) Тогда
    Массив = Новый Массив();
    Массив.Добавить(Тип(СтрокаТипПолучателя));

    ОписаниеТипаПолучателя = Новый ОписаниеТипов(Массив);
    Элементы.Получатель.ОграничениеТипа = ОписаниеТипаПолучателя;
КонецЕсли;

Если Элементы.Договор.Видимость = Истина
    И ЗначениеЗаполнено(Объект.Получатель) Тогда
    Элементы.Договор.Видимость = ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Объект.Получатель);
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)

МассивОчищаемыхРеквизитов = Новый Массив;
Если Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВыдачаПодотчетнику")
    И ЗначениеЗаполнено(Объект.Договор) Тогда
    МассивОчищаемыхРеквизитов.Добавить("Договор");

    ТекстВопроса = "При изменении реквизита ""Вид операции"" будут очищены следующие данные:
    | - Договор
    | Продолжить?";

КонецЕсли;

Если ЗначениеЗаполнено(МассивОчищаемыхРеквизитов) Тогда
    Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииВидаОперации", ЭтаФорма, МассивОчищаемыхРеквизитов);
    ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Внимание!");
Иначе
    ВидОперации =  Объект.ВидОперации;
    УстановитьВидимость();
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОбИзмененииВидаОперации(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Да Тогда
    Для Каждого Реквизит Из ДополнительныеПараметры Цикл
        Объект[Реквизит] = Неопределено;
    КонецЦикла;
    УстановитьВидимость();
    ВидОперации =  Объект.ВидОперации;
Иначе
    Объект.ВидОперации = ВидОперации;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)

ЭтоПоставщик = ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Объект.Получатель);
МассивОчищаемыхРеквизитов = Новый Массив;

Если НЕ ЭтоПоставщик И ЗначениеЗаполнено(Объект.Договор) Тогда
    МассивОчищаемыхРеквизитов.Добавить("Договор");

    ТекстВопроса = "При изменении реквизита ""Получатель"" будут очищены следующие данные:
    | - Договор
    | Продолжить?";
КонецЕсли;

Если ЗначениеЗаполнено(МассивОчищаемыхРеквизитов) Тогда
    Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииПолучатель", ЭтаФорма, МассивОчищаемыхРеквизитов);
    ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Внимание!");
Иначе
    Получатель =  Объект.Получатель;
    УстановитьВидимость();
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОбИзмененииПолучатель(Результат, ДополнительныеПараметры) Экспорт

Если Результат = КодВозвратаДиалога.Да Тогда
    Для Каждого Реквизит Из ДополнительныеПараметры Цикл
        Объект[Реквизит] = Неопределено;
    КонецЦикла;
    УстановитьВидимость();
    Получатель =  Объект.Получатель;
Иначе
    Объект.Получатель = Получатель;
КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьРеквизитыФормы();     
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыФормы()

	Получатель = Объект.Получатель;
	ВидОперации = Объект.ВидОперации;

	Если Объект.Ссылка.Пустая() Тогда
	    Объект.ВидОперации = Перечисления.ВидыОперацийРасходаДенег.ВозвратДенегПокупателю;
	КонецЕсли;
КонецПроцедуры
 
&НаСервереБезКонтекста
Функция ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Получатель)
Запрос = Новый Запрос;
Запрос.УстановитьПараметр("Получатель", Получатель);
Запрос.Текст = "ВЫБРАТЬ
               |    Контрагенты.ТипКонтрагента КАК ТипКонтрагента,
               |    Контрагенты.Ссылка КАК Контрагент
               |ИЗ
               |    Справочник.Контрагенты КАК Контрагенты
               |ГДЕ
               |    Контрагенты.Ссылка = &Получатель";

Выборка = Запрос.Выполнить().Выбрать();
Выборка.Следующий();

Если ЗначениеЗаполнено(Выборка.ТипКонтрагента)
    И Выборка.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиент Тогда
    возврат Ложь;
Иначе
    возврат Истина;
КонецЕсли;
КонецФункции
